Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dag169.h
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF810000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF810004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF810008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF81000C)));
#define PRISS PRISS
extern volatile uint32_t   PRISS __attribute__((section("sfrs"), address(0xBF810010)));
typedef struct {
  uint32_t SS0:1;
  uint32_t :3;
  uint32_t PRI1SS:4;
  uint32_t PRI2SS:4;
  uint32_t PRI3SS:4;
  uint32_t PRI4SS:4;
  uint32_t PRI5SS:4;
  uint32_t PRI6SS:4;
  uint32_t PRI7SS:4;
} __PRISSbits_t;
extern volatile __PRISSbits_t PRISSbits __asm__ ("PRISS") __attribute__((section("sfrs"), address(0xBF810010)));
extern volatile uint32_t        PRISSCLR __attribute__((section("sfrs"),address(0xBF810014)));
extern volatile uint32_t        PRISSSET __attribute__((section("sfrs"),address(0xBF810018)));
extern volatile uint32_t        PRISSINV __attribute__((section("sfrs"),address(0xBF81001C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF810020)));
typedef struct {
  uint32_t SIRQ:8;
  uint32_t SRIPL:3;
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT") __attribute__((section("sfrs"), address(0xBF810020)));
extern volatile uint32_t        INTSTATCLR __attribute__((section("sfrs"),address(0xBF810024)));
extern volatile uint32_t        INTSTATSET __attribute__((section("sfrs"),address(0xBF810028)));
extern volatile uint32_t        INTSTATINV __attribute__((section("sfrs"),address(0xBF81002C)));
#define IPTMR IPTMR
extern volatile uint32_t   IPTMR __attribute__((section("sfrs"), address(0xBF810030)));
typedef struct {
  uint32_t IPTMR:32;
} __IPTMRbits_t;
extern volatile __IPTMRbits_t IPTMRbits __asm__ ("IPTMR") __attribute__((section("sfrs"), address(0xBF810030)));
extern volatile uint32_t        IPTMRCLR __attribute__((section("sfrs"),address(0xBF810034)));
extern volatile uint32_t        IPTMRSET __attribute__((section("sfrs"),address(0xBF810038)));
extern volatile uint32_t        IPTMRINV __attribute__((section("sfrs"),address(0xBF81003C)));
#define IFS0 IFS0
extern volatile uint32_t   IFS0 __attribute__((section("sfrs"), address(0xBF810040)));
typedef union {
  struct {
    uint32_t CTIF:1;
    uint32_t CS0IF:1;
    uint32_t CS1IF:1;
    uint32_t INT0IF:1;
    uint32_t T1IF:1;
    uint32_t IC1EIF:1;
    uint32_t IC1IF:1;
    uint32_t OC1IF:1;
    uint32_t INT1IF:1;
    uint32_t T2IF:1;
    uint32_t IC2EIF:1;
    uint32_t IC2IF:1;
    uint32_t OC2IF:1;
    uint32_t INT2IF:1;
    uint32_t T3IF:1;
    uint32_t IC3EIF:1;
    uint32_t IC3IF:1;
    uint32_t OC3IF:1;
    uint32_t INT3IF:1;
    uint32_t T4IF:1;
    uint32_t IC4EIF:1;
    uint32_t IC4IF:1;
    uint32_t OC4IF:1;
    uint32_t INT4IF:1;
    uint32_t T5IF:1;
    uint32_t IC5EIF:1;
    uint32_t IC5IF:1;
    uint32_t OC5IF:1;
    uint32_t T6IF:1;
    uint32_t IC6EIF:1;
    uint32_t IC6IF:1;
    uint32_t OC6IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS0bits_t;
extern volatile __IFS0bits_t IFS0bits __asm__ ("IFS0") __attribute__((section("sfrs"), address(0xBF810040)));
extern volatile uint32_t        IFS0CLR __attribute__((section("sfrs"),address(0xBF810044)));
extern volatile uint32_t        IFS0SET __attribute__((section("sfrs"),address(0xBF810048)));
extern volatile uint32_t        IFS0INV __attribute__((section("sfrs"),address(0xBF81004C)));
#define IFS1 IFS1
extern volatile uint32_t   IFS1 __attribute__((section("sfrs"), address(0xBF810050)));
typedef union {
  struct {
    uint32_t T7IF:1;
    uint32_t IC7EIF:1;
    uint32_t IC7IF:1;
    uint32_t OC7IF:1;
    uint32_t T8IF:1;
    uint32_t IC8EIF:1;
    uint32_t IC8IF:1;
    uint32_t OC8IF:1;
    uint32_t T9IF:1;
    uint32_t IC9EIF:1;
    uint32_t IC9IF:1;
    uint32_t OC9IF:1;
    uint32_t ADCIF:1;
    uint32_t ADCFIFOIF:1;
    uint32_t ADCDC1IF:1;
    uint32_t ADCDC2IF:1;
    uint32_t ADCDC3IF:1;
    uint32_t ADCDC4IF:1;
    uint32_t ADCDC5IF:1;
    uint32_t ADCDC6IF:1;
    uint32_t ADCDF1IF:1;
    uint32_t ADCDF2IF:1;
    uint32_t ADCDF3IF:1;
    uint32_t ADCDF4IF:1;
    uint32_t ADCDF5IF:1;
    uint32_t ADCDF6IF:1;
    uint32_t ADCFLTIF:1;
    uint32_t ADCD0IF:1;
    uint32_t ADCD1IF:1;
    uint32_t ADCD2IF:1;
    uint32_t ADCD3IF:1;
    uint32_t ADCD4IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS1bits_t;
extern volatile __IFS1bits_t IFS1bits __asm__ ("IFS1") __attribute__((section("sfrs"), address(0xBF810050)));
extern volatile uint32_t        IFS1CLR __attribute__((section("sfrs"),address(0xBF810054)));
extern volatile uint32_t        IFS1SET __attribute__((section("sfrs"),address(0xBF810058)));
extern volatile uint32_t        IFS1INV __attribute__((section("sfrs"),address(0xBF81005C)));
#define IFS2 IFS2
extern volatile uint32_t   IFS2 __attribute__((section("sfrs"), address(0xBF810060)));
typedef union {
  struct {
    uint32_t ADCD5IF:1;
    uint32_t ADCD6IF:1;
    uint32_t ADCD7IF:1;
    uint32_t ADCD8IF:1;
    uint32_t ADCD9IF:1;
    uint32_t ADCD10IF:1;
    uint32_t ADCD11IF:1;
    uint32_t ADCD12IF:1;
    uint32_t ADCD13IF:1;
    uint32_t ADCD14IF:1;
    uint32_t ADCD15IF:1;
    uint32_t ADCD16IF:1;
    uint32_t ADCD17IF:1;
    uint32_t ADCD18IF:1;
    uint32_t ADCD19IF:1;
    uint32_t ADCD20IF:1;
    uint32_t ADCD21IF:1;
    uint32_t ADCD22IF:1;
    uint32_t ADCD23IF:1;
    uint32_t ADCD24IF:1;
    uint32_t ADCD25IF:1;
    uint32_t ADCD26IF:1;
    uint32_t ADCD27IF:1;
    uint32_t ADCD28IF:1;
    uint32_t ADCD29IF:1;
    uint32_t ADCD30IF:1;
    uint32_t ADCD31IF:1;
    uint32_t ADCD32IF:1;
    uint32_t ADCD33IF:1;
    uint32_t ADCD34IF:1;
    uint32_t ADCD35IF:1;
    uint32_t ADCD36IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS2bits_t;
extern volatile __IFS2bits_t IFS2bits __asm__ ("IFS2") __attribute__((section("sfrs"), address(0xBF810060)));
extern volatile uint32_t        IFS2CLR __attribute__((section("sfrs"),address(0xBF810064)));
extern volatile uint32_t        IFS2SET __attribute__((section("sfrs"),address(0xBF810068)));
extern volatile uint32_t        IFS2INV __attribute__((section("sfrs"),address(0xBF81006C)));
#define IFS3 IFS3
extern volatile uint32_t   IFS3 __attribute__((section("sfrs"), address(0xBF810070)));
typedef union {
  struct {
    uint32_t ADCD37IF:1;
    uint32_t ADCD38IF:1;
    uint32_t ADCD39IF:1;
    uint32_t ADCD40IF:1;
    uint32_t ADCD41IF:1;
    uint32_t ADCD42IF:1;
    uint32_t ADCD43IF:1;
    uint32_t USBSRIF:1;
    uint32_t CPCIF:1;
    uint32_t CFDCIF:1;
    uint32_t SBIF:1;
    uint32_t :2;
    uint32_t SPI1EIF:1;
    uint32_t SPI1RXIF:1;
    uint32_t SPI1TXIF:1;
    uint32_t U1EIF:1;
    uint32_t U1RXIF:1;
    uint32_t U1TXIF:1;
    uint32_t I2C1BIF:1;
    uint32_t I2C1SIF:1;
    uint32_t I2C1MIF:1;
    uint32_t CNAIF:1;
    uint32_t CNBIF:1;
    uint32_t CNCIF:1;
    uint32_t CNDIF:1;
    uint32_t CNEIF:1;
    uint32_t CNFIF:1;
    uint32_t CNGIF:1;
    uint32_t CNHIF:1;
    uint32_t CNJIF:1;
    uint32_t CNKIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS3bits_t;
extern volatile __IFS3bits_t IFS3bits __asm__ ("IFS3") __attribute__((section("sfrs"), address(0xBF810070)));
extern volatile uint32_t        IFS3CLR __attribute__((section("sfrs"),address(0xBF810074)));
extern volatile uint32_t        IFS3SET __attribute__((section("sfrs"),address(0xBF810078)));
extern volatile uint32_t        IFS3INV __attribute__((section("sfrs"),address(0xBF81007C)));
#define IFS4 IFS4
extern volatile uint32_t   IFS4 __attribute__((section("sfrs"), address(0xBF810080)));
typedef union {
  struct {
    uint32_t PMPIF:1;
    uint32_t PMPEIF:1;
    uint32_t CMP1IF:1;
    uint32_t CMP2IF:1;
    uint32_t USBIF:1;
    uint32_t USBDMAIF:1;
    uint32_t DMA0IF:1;
    uint32_t DMA1IF:1;
    uint32_t DMA2IF:1;
    uint32_t DMA3IF:1;
    uint32_t DMA4IF:1;
    uint32_t DMA5IF:1;
    uint32_t DMA6IF:1;
    uint32_t DMA7IF:1;
    uint32_t SPI2EIF:1;
    uint32_t SPI2RXIF:1;
    uint32_t SPI2TXIF:1;
    uint32_t U2EIF:1;
    uint32_t U2RXIF:1;
    uint32_t U2TXIF:1;
    uint32_t I2C2BIF:1;
    uint32_t I2C2SIF:1;
    uint32_t I2C2MIF:1;
    uint32_t CAN1IF:1;
    uint32_t CAN2IF:1;
    uint32_t ETHIF:1;
    uint32_t SPI3EIF:1;
    uint32_t SPI3RXIF:1;
    uint32_t SPI3TXIF:1;
    uint32_t U3EIF:1;
    uint32_t U3RXIF:1;
    uint32_t U3TXIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS4bits_t;
extern volatile __IFS4bits_t IFS4bits __asm__ ("IFS4") __attribute__((section("sfrs"), address(0xBF810080)));
extern volatile uint32_t        IFS4CLR __attribute__((section("sfrs"),address(0xBF810084)));
extern volatile uint32_t        IFS4SET __attribute__((section("sfrs"),address(0xBF810088)));
extern volatile uint32_t        IFS4INV __attribute__((section("sfrs"),address(0xBF81008C)));
#define IFS5 IFS5
extern volatile uint32_t   IFS5 __attribute__((section("sfrs"), address(0xBF810090)));
typedef union {
  struct {
    uint32_t I2C3BIF:1;
    uint32_t I2C3SIF:1;
    uint32_t I2C3MIF:1;
    uint32_t SPI4EIF:1;
    uint32_t SPI4RXIF:1;
    uint32_t SPI4TXIF:1;
    uint32_t RTCCIF:1;
    uint32_t FCEIF:1;
    uint32_t PREIF:1;
    uint32_t SQI1IF:1;
    uint32_t U4EIF:1;
    uint32_t U4RXIF:1;
    uint32_t U4TXIF:1;
    uint32_t I2C4BIF:1;
    uint32_t I2C4SIF:1;
    uint32_t I2C4MIF:1;
    uint32_t SPI5EIF:1;
    uint32_t SPI5RXIF:1;
    uint32_t SPI5TXIF:1;
    uint32_t U5EIF:1;
    uint32_t U5RXIF:1;
    uint32_t U5TXIF:1;
    uint32_t I2C5BIF:1;
    uint32_t I2C5SIF:1;
    uint32_t I2C5MIF:1;
    uint32_t SPI6IF:1;
    uint32_t SPI6RXIF:1;
    uint32_t SPI6TX:1;
    uint32_t U6EIF:1;
    uint32_t U6RXIF:1;
    uint32_t U6TXIF:1;
    uint32_t SDHCIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS5bits_t;
extern volatile __IFS5bits_t IFS5bits __asm__ ("IFS5") __attribute__((section("sfrs"), address(0xBF810090)));
extern volatile uint32_t        IFS5CLR __attribute__((section("sfrs"),address(0xBF810094)));
extern volatile uint32_t        IFS5SET __attribute__((section("sfrs"),address(0xBF810098)));
extern volatile uint32_t        IFS5INV __attribute__((section("sfrs"),address(0xBF81009C)));
#define IFS6 IFS6
extern volatile uint32_t   IFS6 __attribute__((section("sfrs"), address(0xBF8100A0)));
typedef union {
  struct {
    uint32_t GLCDIF:1;
    uint32_t GPUIF:1;
    uint32_t :1;
    uint32_t CTMUIF:1;
    uint32_t ADCEOSIF:1;
    uint32_t ADCARDYIF:1;
    uint32_t ADCURDYIF:1;
    uint32_t ADC0EIF:1;
    uint32_t ADC1EIF:1;
    uint32_t ADC2EIF:1;
    uint32_t ADC3EIF:1;
    uint32_t ADC4EIF:1;
    uint32_t :1;
    uint32_t ADCGRPIF:1;
    uint32_t ADC7EIF:1;
    uint32_t ADC0WIF:1;
    uint32_t ADC1WIF:1;
    uint32_t ADC2WIF:1;
    uint32_t ADC3WIF:1;
    uint32_t ADC4WIF:1;
    uint32_t :2;
    uint32_t ADC7WIF:1;
    uint32_t MPLLFLTIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS6bits_t;
extern volatile __IFS6bits_t IFS6bits __asm__ ("IFS6") __attribute__((section("sfrs"), address(0xBF8100A0)));
extern volatile uint32_t        IFS6CLR __attribute__((section("sfrs"),address(0xBF8100A4)));
extern volatile uint32_t        IFS6SET __attribute__((section("sfrs"),address(0xBF8100A8)));
extern volatile uint32_t        IFS6INV __attribute__((section("sfrs"),address(0xBF8100AC)));
#define IEC0 IEC0
extern volatile uint32_t   IEC0 __attribute__((section("sfrs"), address(0xBF8100C0)));
typedef union {
  struct {
    uint32_t CTIE:1;
    uint32_t CS0IE:1;
    uint32_t CS1IE:1;
    uint32_t INT0IE:1;
    uint32_t T1IE:1;
    uint32_t IC1EIE:1;
    uint32_t IC1IE:1;
    uint32_t OC1IE:1;
    uint32_t INT1IE:1;
    uint32_t T2IE:1;
    uint32_t IC2EIE:1;
    uint32_t IC2IE:1;
    uint32_t OC2IE:1;
    uint32_t INT2IE:1;
    uint32_t T3IE:1;
    uint32_t IC3EIE:1;
    uint32_t IC3IE:1;
    uint32_t OC3IE:1;
    uint32_t INT3IE:1;
    uint32_t T4IE:1;
    uint32_t IC4EIE:1;
    uint32_t IC4IE:1;
    uint32_t OC4IE:1;
    uint32_t INT4IE:1;
    uint32_t T5IE:1;
    uint32_t IC5EIE:1;
    uint32_t IC5IE:1;
    uint32_t OC5IE:1;
    uint32_t T6IE:1;
    uint32_t IC6EIE:1;
    uint32_t IC6IE:1;
    uint32_t OC6IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC0bits_t;
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs"), address(0xBF8100C0)));
extern volatile uint32_t        IEC0CLR __attribute__((section("sfrs"),address(0xBF8100C4)));
extern volatile uint32_t        IEC0SET __attribute__((section("sfrs"),address(0xBF8100C8)));
extern volatile uint32_t        IEC0INV __attribute__((section("sfrs"),address(0xBF8100CC)));
#define IEC1 IEC1
extern volatile uint32_t   IEC1 __attribute__((section("sfrs"), address(0xBF8100D0)));
typedef union {
  struct {
    uint32_t T7IE:1;
    uint32_t IC7EIE:1;
    uint32_t IC7IE:1;
    uint32_t OC7IE:1;
    uint32_t T8IE:1;
    uint32_t IC8EIE:1;
    uint32_t IC8IE:1;
    uint32_t OC8IE:1;
    uint32_t T9IE:1;
    uint32_t IC9EIE:1;
    uint32_t IC9IE:1;
    uint32_t OC9IE:1;
    uint32_t ADCIE:1;
    uint32_t ADCFIFOIE:1;
    uint32_t ADCDC1IE:1;
    uint32_t ADCDC2IE:1;
    uint32_t ADCDC3IE:1;
    uint32_t ADCDC4IE:1;
    uint32_t ADCDC5IE:1;
    uint32_t ADCDC6IE:1;
    uint32_t ADCDF1IE:1;
    uint32_t ADCDF2IE:1;
    uint32_t ADCDF3IE:1;
    uint32_t ADCDF4IE:1;
    uint32_t ADCDF5IE:1;
    uint32_t ADCDF6IE:1;
    uint32_t ADCFLTIE:1;
    uint32_t ADCD0IE:1;
    uint32_t ADCD1IE:1;
    uint32_t ADCD2IE:1;
    uint32_t ADCD3IE:1;
    uint32_t ADCD4IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs"), address(0xBF8100D0)));
extern volatile uint32_t        IEC1CLR __attribute__((section("sfrs"),address(0xBF8100D4)));
extern volatile uint32_t        IEC1SET __attribute__((section("sfrs"),address(0xBF8100D8)));
extern volatile uint32_t        IEC1INV __attribute__((section("sfrs"),address(0xBF8100DC)));
#define IEC2 IEC2
extern volatile uint32_t   IEC2 __attribute__((section("sfrs"), address(0xBF8100E0)));
typedef union {
  struct {
    uint32_t ADCD5IE:1;
    uint32_t ADCD6IE:1;
    uint32_t ADCD7IE:1;
    uint32_t ADCD8IE:1;
    uint32_t ADCD9IE:1;
    uint32_t ADCD10IE:1;
    uint32_t ADCD11IE:1;
    uint32_t ADCD12IE:1;
    uint32_t ADCD13IE:1;
    uint32_t ADCD14IE:1;
    uint32_t ADCD15IE:1;
    uint32_t ADCD16IE:1;
    uint32_t ADCD17IE:1;
    uint32_t ADCD18IE:1;
    uint32_t ADCD19IE:1;
    uint32_t ADCD20IE:1;
    uint32_t ADCD21IE:1;
    uint32_t ADCD22IE:1;
    uint32_t ADCD23IE:1;
    uint32_t ADCD24IE:1;
    uint32_t ADCD25IE:1;
    uint32_t ADCD26IE:1;
    uint32_t ADCD27IE:1;
    uint32_t ADCD28IE:1;
    uint32_t ADCD29IE:1;
    uint32_t ADCD30IE:1;
    uint32_t ADCD31IE:1;
    uint32_t ADCD32IE:1;
    uint32_t ADCD33IE:1;
    uint32_t ADCD34IE:1;
    uint32_t ADCD35IE:1;
    uint32_t ADCD36IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC2bits_t;
extern volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs"), address(0xBF8100E0)));
extern volatile uint32_t        IEC2CLR __attribute__((section("sfrs"),address(0xBF8100E4)));
extern volatile uint32_t        IEC2SET __attribute__((section("sfrs"),address(0xBF8100E8)));
extern volatile uint32_t        IEC2INV __attribute__((section("sfrs"),address(0xBF8100EC)));
#define IEC3 IEC3
extern volatile uint32_t   IEC3 __attribute__((section("sfrs"), address(0xBF8100F0)));
typedef union {
  struct {
    uint32_t ADCD37IE:1;
    uint32_t ADCD38IE:1;
    uint32_t ADCD39IE:1;
    uint32_t ADCD40IE:1;
    uint32_t ADCD41IE:1;
    uint32_t ADCD42IE:1;
    uint32_t ADCD43IE:1;
    uint32_t USBSRIE:1;
    uint32_t CPCIE:1;
    uint32_t CFDCIE:1;
    uint32_t SBIE:1;
    uint32_t :2;
    uint32_t SPI1EIE:1;
    uint32_t SPI1RXIE:1;
    uint32_t SPI1TXIE:1;
    uint32_t U1EIE:1;
    uint32_t U1RXIE:1;
    uint32_t U1TXIE:1;
    uint32_t I2C1BIE:1;
    uint32_t I2C1SIE:1;
    uint32_t I2C1MIE:1;
    uint32_t CNAIE:1;
    uint32_t CNBIE:1;
    uint32_t CNCIE:1;
    uint32_t CNDIE:1;
    uint32_t CNEIE:1;
    uint32_t CNFIE:1;
    uint32_t CNGIE:1;
    uint32_t CNHIE:1;
    uint32_t CNJIE:1;
    uint32_t CNKIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC3bits_t;
extern volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs"), address(0xBF8100F0)));
extern volatile uint32_t        IEC3CLR __attribute__((section("sfrs"),address(0xBF8100F4)));
extern volatile uint32_t        IEC3SET __attribute__((section("sfrs"),address(0xBF8100F8)));
extern volatile uint32_t        IEC3INV __attribute__((section("sfrs"),address(0xBF8100FC)));
#define IEC4 IEC4
extern volatile uint32_t   IEC4 __attribute__((section("sfrs"), address(0xBF810100)));
typedef union {
  struct {
    uint32_t PMPIE:1;
    uint32_t PMPEIE:1;
    uint32_t CMP1IE:1;
    uint32_t CMP2IE:1;
    uint32_t USBIE:1;
    uint32_t USBDMAIE:1;
    uint32_t DMA0IE:1;
    uint32_t DMA1IE:1;
    uint32_t DMA2IE:1;
    uint32_t DMA3IE:1;
    uint32_t DMA4IE:1;
    uint32_t DMA5IE:1;
    uint32_t DMA6IE:1;
    uint32_t DMA7IE:1;
    uint32_t SPI2EIE:1;
    uint32_t SPI2RXIE:1;
    uint32_t SPI2TXIE:1;
    uint32_t U2EIE:1;
    uint32_t U2RXIE:1;
    uint32_t U2TXIE:1;
    uint32_t I2C2BIE:1;
    uint32_t I2C2SIE:1;
    uint32_t I2C2MIE:1;
    uint32_t CAN1IE:1;
    uint32_t CAN2IE:1;
    uint32_t ETHIE:1;
    uint32_t SPI3EIE:1;
    uint32_t SPI3RXIE:1;
    uint32_t SPI3TXIE:1;
    uint32_t U3EIE:1;
    uint32_t U3RXIE:1;
    uint32_t U3TXIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC4bits_t;
