Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dag169.h
extern volatile __DCH4DPTRbits_t DCH4DPTRbits __asm__ ("DCH4DPTR") __attribute__((section("sfrs"), address(0xBF8113E0)));
extern volatile uint32_t        DCH4DPTRCLR __attribute__((section("sfrs"),address(0xBF8113E4)));
extern volatile uint32_t        DCH4DPTRSET __attribute__((section("sfrs"),address(0xBF8113E8)));
extern volatile uint32_t        DCH4DPTRINV __attribute__((section("sfrs"),address(0xBF8113EC)));
#define DCH4CSIZ DCH4CSIZ
extern volatile uint32_t   DCH4CSIZ __attribute__((section("sfrs"), address(0xBF8113F0)));
typedef struct {
  uint32_t CHCSIZ:16;
} __DCH4CSIZbits_t;
extern volatile __DCH4CSIZbits_t DCH4CSIZbits __asm__ ("DCH4CSIZ") __attribute__((section("sfrs"), address(0xBF8113F0)));
extern volatile uint32_t        DCH4CSIZCLR __attribute__((section("sfrs"),address(0xBF8113F4)));
extern volatile uint32_t        DCH4CSIZSET __attribute__((section("sfrs"),address(0xBF8113F8)));
extern volatile uint32_t        DCH4CSIZINV __attribute__((section("sfrs"),address(0xBF8113FC)));
#define DCH4CPTR DCH4CPTR
extern volatile uint32_t   DCH4CPTR __attribute__((section("sfrs"), address(0xBF811400)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH4CPTRbits_t;
extern volatile __DCH4CPTRbits_t DCH4CPTRbits __asm__ ("DCH4CPTR") __attribute__((section("sfrs"), address(0xBF811400)));
#define DCS4CPTR DCS4CPTR
extern volatile uint32_t   DCS4CPTR __attribute__((section("sfrs"), address(0xBF811400)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS4CPTRbits_t;
extern volatile __DCS4CPTRbits_t DCS4CPTRbits __asm__ ("DCS4CPTR") __attribute__((section("sfrs"), address(0xBF811400)));
extern volatile uint32_t        DCH4CPTRCLR __attribute__((section("sfrs"),address(0xBF811404)));
extern volatile uint32_t        DCS4CPTRCLR __attribute__((section("sfrs"),address(0xBF811404)));
extern volatile uint32_t        DCH4CPTRSET __attribute__((section("sfrs"),address(0xBF811408)));
extern volatile uint32_t        DCS4CPTRSET __attribute__((section("sfrs"),address(0xBF811408)));
extern volatile uint32_t        DCH4CPTRINV __attribute__((section("sfrs"),address(0xBF81140C)));
extern volatile uint32_t        DCS4CPTRINV __attribute__((section("sfrs"),address(0xBF81140C)));
#define DCH4DAT DCH4DAT
extern volatile uint32_t   DCH4DAT __attribute__((section("sfrs"), address(0xBF811410)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH4DATbits_t;
extern volatile __DCH4DATbits_t DCH4DATbits __asm__ ("DCH4DAT") __attribute__((section("sfrs"), address(0xBF811410)));
extern volatile uint32_t        DCH4DATCLR __attribute__((section("sfrs"),address(0xBF811414)));
extern volatile uint32_t        DCH4DATSET __attribute__((section("sfrs"),address(0xBF811418)));
extern volatile uint32_t        DCH4DATINV __attribute__((section("sfrs"),address(0xBF81141C)));
#define DCH5CON DCH5CON
extern volatile uint32_t   DCH5CON __attribute__((section("sfrs"), address(0xBF811420)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH5CONbits_t;
extern volatile __DCH5CONbits_t DCH5CONbits __asm__ ("DCH5CON") __attribute__((section("sfrs"), address(0xBF811420)));
extern volatile uint32_t        DCH5CONCLR __attribute__((section("sfrs"),address(0xBF811424)));
extern volatile uint32_t        DCH5CONSET __attribute__((section("sfrs"),address(0xBF811428)));
extern volatile uint32_t        DCH5CONINV __attribute__((section("sfrs"),address(0xBF81142C)));
#define DCH5ECON DCH5ECON
extern volatile uint32_t   DCH5ECON __attribute__((section("sfrs"), address(0xBF811430)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH5ECONbits_t;
extern volatile __DCH5ECONbits_t DCH5ECONbits __asm__ ("DCH5ECON") __attribute__((section("sfrs"), address(0xBF811430)));
extern volatile uint32_t        DCH5ECONCLR __attribute__((section("sfrs"),address(0xBF811434)));
extern volatile uint32_t        DCH5ECONSET __attribute__((section("sfrs"),address(0xBF811438)));
extern volatile uint32_t        DCH5ECONINV __attribute__((section("sfrs"),address(0xBF81143C)));
#define DCH5INT DCH5INT
extern volatile uint32_t   DCH5INT __attribute__((section("sfrs"), address(0xBF811440)));
typedef struct {
  uint32_t CHERIF:1;
  uint32_t CHTAIF:1;
  uint32_t CHCCIF:1;
  uint32_t CHBCIF:1;
  uint32_t CHDHIF:1;
  uint32_t CHDDIF:1;
  uint32_t CHSHIF:1;
  uint32_t CHSDIF:1;
  uint32_t :8;
  uint32_t CHERIE:1;
  uint32_t CHTAIE:1;
  uint32_t CHCCIE:1;
  uint32_t CHBCIE:1;
  uint32_t CHDHIE:1;
  uint32_t CHDDIE:1;
  uint32_t CHSHIE:1;
  uint32_t CHSDIE:1;
} __DCH5INTbits_t;
extern volatile __DCH5INTbits_t DCH5INTbits __asm__ ("DCH5INT") __attribute__((section("sfrs"), address(0xBF811440)));
extern volatile uint32_t        DCH5INTCLR __attribute__((section("sfrs"),address(0xBF811444)));
extern volatile uint32_t        DCH5INTSET __attribute__((section("sfrs"),address(0xBF811448)));
extern volatile uint32_t        DCH5INTINV __attribute__((section("sfrs"),address(0xBF81144C)));
#define DCH5SSA DCH5SSA
extern volatile uint32_t   DCH5SSA __attribute__((section("sfrs"), address(0xBF811450)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH5SSAbits_t;
extern volatile __DCH5SSAbits_t DCH5SSAbits __asm__ ("DCH5SSA") __attribute__((section("sfrs"), address(0xBF811450)));
extern volatile uint32_t        DCH5SSACLR __attribute__((section("sfrs"),address(0xBF811454)));
extern volatile uint32_t        DCH5SSASET __attribute__((section("sfrs"),address(0xBF811458)));
extern volatile uint32_t        DCH5SSAINV __attribute__((section("sfrs"),address(0xBF81145C)));
#define DCH5DSA DCH5DSA
extern volatile uint32_t   DCH5DSA __attribute__((section("sfrs"), address(0xBF811460)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH5DSAbits_t;
