Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dag169.h
extern volatile __EBIMSK0bits_t EBIMSK0bits __asm__ ("EBIMSK0") __attribute__((section("sfrs"), address(0xBF8E1054)));
#define EBIMSK1 EBIMSK1
extern volatile uint32_t   EBIMSK1 __attribute__((section("sfrs"), address(0xBF8E1058)));
typedef struct {
  uint32_t MEMSIZE:5;
  uint32_t MEMTYPE:3;
  uint32_t REGSEL:3;
} __EBIMSK1bits_t;
extern volatile __EBIMSK1bits_t EBIMSK1bits __asm__ ("EBIMSK1") __attribute__((section("sfrs"), address(0xBF8E1058)));
#define EBIMSK2 EBIMSK2
extern volatile uint32_t   EBIMSK2 __attribute__((section("sfrs"), address(0xBF8E105C)));
typedef struct {
  uint32_t MEMSIZE:5;
  uint32_t MEMTYPE:3;
  uint32_t REGSEL:3;
} __EBIMSK2bits_t;
extern volatile __EBIMSK2bits_t EBIMSK2bits __asm__ ("EBIMSK2") __attribute__((section("sfrs"), address(0xBF8E105C)));
#define EBIMSK3 EBIMSK3
extern volatile uint32_t   EBIMSK3 __attribute__((section("sfrs"), address(0xBF8E1060)));
typedef struct {
  uint32_t MEMSIZE:5;
  uint32_t MEMTYPE:3;
  uint32_t REGSEL:3;
} __EBIMSK3bits_t;
extern volatile __EBIMSK3bits_t EBIMSK3bits __asm__ ("EBIMSK3") __attribute__((section("sfrs"), address(0xBF8E1060)));
#define EBISMT0 EBISMT0
extern volatile uint32_t   EBISMT0 __attribute__((section("sfrs"), address(0xBF8E1094)));
typedef struct {
  uint32_t TRC:6;
  uint32_t TAS:2;
  uint32_t TWR:2;
  uint32_t TWP:6;
  uint32_t TBTA:3;
  uint32_t TPRC:4;
  uint32_t PAGEMODE:1;
  uint32_t PAGESIZE:2;
  uint32_t RDYMODE:1;
} __EBISMT0bits_t;
extern volatile __EBISMT0bits_t EBISMT0bits __asm__ ("EBISMT0") __attribute__((section("sfrs"), address(0xBF8E1094)));
#define EBISMT1 EBISMT1
extern volatile uint32_t   EBISMT1 __attribute__((section("sfrs"), address(0xBF8E1098)));
typedef struct {
  uint32_t TRC:6;
  uint32_t TAS:2;
  uint32_t TWR:2;
  uint32_t TWP:6;
  uint32_t TBTA:3;
  uint32_t TPRC:4;
  uint32_t PAGEMODE:1;
  uint32_t PAGESIZE:2;
  uint32_t RDYMODE:1;
} __EBISMT1bits_t;
extern volatile __EBISMT1bits_t EBISMT1bits __asm__ ("EBISMT1") __attribute__((section("sfrs"), address(0xBF8E1098)));
#define EBISMT2 EBISMT2
extern volatile uint32_t   EBISMT2 __attribute__((section("sfrs"), address(0xBF8E109C)));
typedef struct {
  uint32_t TRC:6;
  uint32_t TAS:2;
  uint32_t TWR:2;
  uint32_t TWP:6;
  uint32_t TBTA:3;
  uint32_t TPRC:4;
  uint32_t PAGEMODE:1;
  uint32_t PAGESIZE:2;
  uint32_t RDYMODE:1;
} __EBISMT2bits_t;
extern volatile __EBISMT2bits_t EBISMT2bits __asm__ ("EBISMT2") __attribute__((section("sfrs"), address(0xBF8E109C)));
#define EBIFTRPD EBIFTRPD
extern volatile uint32_t   EBIFTRPD __attribute__((section("sfrs"), address(0xBF8E10A0)));
typedef struct {
  uint32_t TRPD:32;
} __EBIFTRPDbits_t;
extern volatile __EBIFTRPDbits_t EBIFTRPDbits __asm__ ("EBIFTRPD") __attribute__((section("sfrs"), address(0xBF8E10A0)));
#define EBISMCON EBISMCON
extern volatile uint32_t   EBISMCON __attribute__((section("sfrs"), address(0xBF8E10A4)));
typedef struct {
  uint32_t SMRP:1;
  uint32_t :6;
  uint32_t SMDWIDTH0:3;
  uint32_t SMDWIDTH1:3;
  uint32_t SMDWIDTH2:3;
} __EBISMCONbits_t;
extern volatile __EBISMCONbits_t EBISMCONbits __asm__ ("EBISMCON") __attribute__((section("sfrs"), address(0xBF8E10A4)));
#define SQI1XCON1 SQI1XCON1
extern volatile uint32_t   SQI1XCON1 __attribute__((section("sfrs"), address(0xBF8E2000)));
typedef struct {
  uint32_t TYPECMD:2;
  uint32_t TYPEADDR:2;
  uint32_t TYPEMODE:2;
  uint32_t TYPEDUMMY:2;
  uint32_t TYPEDATA:2;
  uint32_t READOPCODE:8;
  uint32_t ADDRBYTES:3;
  uint32_t DUMMYBYTES:3;
  uint32_t DDRCMD:1;
  uint32_t DDRADDR:1;
  uint32_t DDRMODE:1;
  uint32_t DDRDUMMY:1;
  uint32_t DDRDATA:1;
  uint32_t SDRCMD:1;
} __SQI1XCON1bits_t;
extern volatile __SQI1XCON1bits_t SQI1XCON1bits __asm__ ("SQI1XCON1") __attribute__((section("sfrs"), address(0xBF8E2000)));
#define SQI1XCON2 SQI1XCON2
extern volatile uint32_t   SQI1XCON2 __attribute__((section("sfrs"), address(0xBF8E2004)));
typedef struct {
  uint32_t MODECODE:8;
  uint32_t MODEBYTES:2;
  uint32_t DEVSEL:2;
} __SQI1XCON2bits_t;
extern volatile __SQI1XCON2bits_t SQI1XCON2bits __asm__ ("SQI1XCON2") __attribute__((section("sfrs"), address(0xBF8E2004)));
#define SQI1CFG SQI1CFG
extern volatile uint32_t   SQI1CFG __attribute__((section("sfrs"), address(0xBF8E2008)));
typedef struct {
  uint32_t MODE:3;
  uint32_t CPHA:1;
  uint32_t CPOL:1;
  uint32_t LSBF:1;
  uint32_t :3;
  uint32_t WP:1;
  uint32_t HOLD:1;
  uint32_t :1;
  uint32_t BURSTEN:1;
  uint32_t :3;
  uint32_t RESET:1;
  uint32_t TXBUFRST:1;
  uint32_t RXBUFRST:1;
  uint32_t CONBUFRST:1;
  uint32_t DATAEN:2;
  uint32_t :1;
  uint32_t SQIEN:1;
  uint32_t CSEN:2;
} __SQI1CFGbits_t;
extern volatile __SQI1CFGbits_t SQI1CFGbits __asm__ ("SQI1CFG") __attribute__((section("sfrs"), address(0xBF8E2008)));
#define SQI1CON SQI1CON
extern volatile uint32_t   SQI1CON __attribute__((section("sfrs"), address(0xBF8E200C)));
typedef struct {
  uint32_t TXRXCOUNT:16;
  uint32_t CMDINIT:2;
  uint32_t LANEMODE:2;
  uint32_t DEVSEL:2;
  uint32_t DASSERT:1;
  uint32_t DDRMODE:1;
  uint32_t SCHECK:1;
} __SQI1CONbits_t;
extern volatile __SQI1CONbits_t SQI1CONbits __asm__ ("SQI1CON") __attribute__((section("sfrs"), address(0xBF8E200C)));
#define SQI1CLKCON SQI1CLKCON
extern volatile uint32_t   SQI1CLKCON __attribute__((section("sfrs"), address(0xBF8E2010)));
typedef struct {
  uint32_t EN:1;
  uint32_t STABLE:1;
  uint32_t :6;
  uint32_t CLKDIV:11;
} __SQI1CLKCONbits_t;
extern volatile __SQI1CLKCONbits_t SQI1CLKCONbits __asm__ ("SQI1CLKCON") __attribute__((section("sfrs"), address(0xBF8E2010)));
#define SQI1CMDTHR SQI1CMDTHR
extern volatile uint32_t   SQI1CMDTHR __attribute__((section("sfrs"), address(0xBF8E2014)));
typedef struct {
  uint32_t RXCMDTHR:6;
  uint32_t :2;
  uint32_t TXCMDTHR:6;
} __SQI1CMDTHRbits_t;
extern volatile __SQI1CMDTHRbits_t SQI1CMDTHRbits __asm__ ("SQI1CMDTHR") __attribute__((section("sfrs"), address(0xBF8E2014)));
#define SQI1INTTHR SQI1INTTHR
extern volatile uint32_t   SQI1INTTHR __attribute__((section("sfrs"), address(0xBF8E2018)));
typedef struct {
  uint32_t RXINTTHR:6;
  uint32_t :2;
  uint32_t TXINTTHR:6;
} __SQI1INTTHRbits_t;
extern volatile __SQI1INTTHRbits_t SQI1INTTHRbits __asm__ ("SQI1INTTHR") __attribute__((section("sfrs"), address(0xBF8E2018)));
#define SQI1INTEN SQI1INTEN
extern volatile uint32_t   SQI1INTEN __attribute__((section("sfrs"), address(0xBF8E201C)));
typedef struct {
  uint32_t TXEMPTYIE:1;
  uint32_t TXFULLIE:1;
  uint32_t TXTHRIE:1;
  uint32_t RXEMPTYIE:1;
  uint32_t RXFULLIE:1;
  uint32_t RXTHRIE:1;
  uint32_t CONFULLIE:1;
  uint32_t CONEMPTYIE:1;
  uint32_t CONTHRIE:1;
  uint32_t BDDONEIE:1;
  uint32_t PKTCOMPIE:1;
  uint32_t DMAEIE:1;
} __SQI1INTENbits_t;
extern volatile __SQI1INTENbits_t SQI1INTENbits __asm__ ("SQI1INTEN") __attribute__((section("sfrs"), address(0xBF8E201C)));
#define SQI1INTSTAT SQI1INTSTAT
extern volatile uint32_t   SQI1INTSTAT __attribute__((section("sfrs"), address(0xBF8E2020)));
typedef struct {
  uint32_t TXEMPTYIF:1;
  uint32_t TXFULLIF:1;
  uint32_t TXTHRIF:1;
  uint32_t RXEMPTYIF:1;
  uint32_t RXFULLIF:1;
  uint32_t RXTHRIF:1;
  uint32_t CONFULLIF:1;
  uint32_t CONEMPTYIF:1;
  uint32_t CONTHRIF:1;
  uint32_t BDDONEIF:1;
  uint32_t PKTCOMPIF:1;
  uint32_t DMAEIF:1;
} __SQI1INTSTATbits_t;
