Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dag169.h
extern volatile __GLCDCLUT242bits_t GLCDCLUT242bits __asm__ ("GLCDCLUT242") __attribute__((section("sfrs"), address(0xBF8EA7C8)));
#define GLCDCLUT243 GLCDCLUT243
extern volatile uint32_t   GLCDCLUT243 __attribute__((section("sfrs"), address(0xBF8EA7CC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT243bits_t;
extern volatile __GLCDCLUT243bits_t GLCDCLUT243bits __asm__ ("GLCDCLUT243") __attribute__((section("sfrs"), address(0xBF8EA7CC)));
#define GLCDCLUT244 GLCDCLUT244
extern volatile uint32_t   GLCDCLUT244 __attribute__((section("sfrs"), address(0xBF8EA7D0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT244bits_t;
extern volatile __GLCDCLUT244bits_t GLCDCLUT244bits __asm__ ("GLCDCLUT244") __attribute__((section("sfrs"), address(0xBF8EA7D0)));
#define GLCDCLUT245 GLCDCLUT245
extern volatile uint32_t   GLCDCLUT245 __attribute__((section("sfrs"), address(0xBF8EA7D4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT245bits_t;
extern volatile __GLCDCLUT245bits_t GLCDCLUT245bits __asm__ ("GLCDCLUT245") __attribute__((section("sfrs"), address(0xBF8EA7D4)));
#define GLCDCLUT246 GLCDCLUT246
extern volatile uint32_t   GLCDCLUT246 __attribute__((section("sfrs"), address(0xBF8EA7D8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT246bits_t;
extern volatile __GLCDCLUT246bits_t GLCDCLUT246bits __asm__ ("GLCDCLUT246") __attribute__((section("sfrs"), address(0xBF8EA7D8)));
#define GLCDCLUT247 GLCDCLUT247
extern volatile uint32_t   GLCDCLUT247 __attribute__((section("sfrs"), address(0xBF8EA7DC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT247bits_t;
extern volatile __GLCDCLUT247bits_t GLCDCLUT247bits __asm__ ("GLCDCLUT247") __attribute__((section("sfrs"), address(0xBF8EA7DC)));
#define GLCDCLUT248 GLCDCLUT248
extern volatile uint32_t   GLCDCLUT248 __attribute__((section("sfrs"), address(0xBF8EA7E0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT248bits_t;
extern volatile __GLCDCLUT248bits_t GLCDCLUT248bits __asm__ ("GLCDCLUT248") __attribute__((section("sfrs"), address(0xBF8EA7E0)));
#define GLCDCLUT249 GLCDCLUT249
extern volatile uint32_t   GLCDCLUT249 __attribute__((section("sfrs"), address(0xBF8EA7E4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT249bits_t;
extern volatile __GLCDCLUT249bits_t GLCDCLUT249bits __asm__ ("GLCDCLUT249") __attribute__((section("sfrs"), address(0xBF8EA7E4)));
#define GLCDCLUT250 GLCDCLUT250
extern volatile uint32_t   GLCDCLUT250 __attribute__((section("sfrs"), address(0xBF8EA7E8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT250bits_t;
extern volatile __GLCDCLUT250bits_t GLCDCLUT250bits __asm__ ("GLCDCLUT250") __attribute__((section("sfrs"), address(0xBF8EA7E8)));
#define GLCDCLUT251 GLCDCLUT251
extern volatile uint32_t   GLCDCLUT251 __attribute__((section("sfrs"), address(0xBF8EA7EC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT251bits_t;
extern volatile __GLCDCLUT251bits_t GLCDCLUT251bits __asm__ ("GLCDCLUT251") __attribute__((section("sfrs"), address(0xBF8EA7EC)));
#define GLCDCLUT252 GLCDCLUT252
extern volatile uint32_t   GLCDCLUT252 __attribute__((section("sfrs"), address(0xBF8EA7F0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT252bits_t;
extern volatile __GLCDCLUT252bits_t GLCDCLUT252bits __asm__ ("GLCDCLUT252") __attribute__((section("sfrs"), address(0xBF8EA7F0)));
#define GLCDCLUT253 GLCDCLUT253
extern volatile uint32_t   GLCDCLUT253 __attribute__((section("sfrs"), address(0xBF8EA7F4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT253bits_t;
extern volatile __GLCDCLUT253bits_t GLCDCLUT253bits __asm__ ("GLCDCLUT253") __attribute__((section("sfrs"), address(0xBF8EA7F4)));
#define GLCDCLUT254 GLCDCLUT254
extern volatile uint32_t   GLCDCLUT254 __attribute__((section("sfrs"), address(0xBF8EA7F8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT254bits_t;
extern volatile __GLCDCLUT254bits_t GLCDCLUT254bits __asm__ ("GLCDCLUT254") __attribute__((section("sfrs"), address(0xBF8EA7F8)));
#define GLCDCLUT255 GLCDCLUT255
extern volatile uint32_t   GLCDCLUT255 __attribute__((section("sfrs"), address(0xBF8EA7FC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT255bits_t;
extern volatile __GLCDCLUT255bits_t GLCDCLUT255bits __asm__ ("GLCDCLUT255") __attribute__((section("sfrs"), address(0xBF8EA7FC)));
#define GLCDCURDATA0 GLCDCURDATA0
extern volatile uint32_t   GLCDCURDATA0 __attribute__((section("sfrs"), address(0xBF8EA800)));
typedef struct {
  uint32_t PIXEL07:4;
  uint32_t PIXEL06:4;
  uint32_t PIXEL05:4;
  uint32_t PIXEL04:4;
  uint32_t PIXEL03:4;
  uint32_t PIXEL02:4;
  uint32_t PIXEL01:4;
  uint32_t PIXEL00:4;
} __GLCDCURDATA0bits_t;
extern volatile __GLCDCURDATA0bits_t GLCDCURDATA0bits __asm__ ("GLCDCURDATA0") __attribute__((section("sfrs"), address(0xBF8EA800)));
#define GLCDCURDATA1 GLCDCURDATA1
extern volatile uint32_t   GLCDCURDATA1 __attribute__((section("sfrs"), address(0xBF8EA804)));
typedef struct {
  uint32_t PIXEL015:4;
  uint32_t PIXEL014:4;
  uint32_t PIXEL013:4;
  uint32_t PIXEL012:4;
  uint32_t PIXEL011:4;
  uint32_t PIXEL010:4;
  uint32_t PIXEL09:4;
  uint32_t PIXEL08:4;
} __GLCDCURDATA1bits_t;
extern volatile __GLCDCURDATA1bits_t GLCDCURDATA1bits __asm__ ("GLCDCURDATA1") __attribute__((section("sfrs"), address(0xBF8EA804)));
#define GLCDCURDATA2 GLCDCURDATA2
extern volatile uint32_t   GLCDCURDATA2 __attribute__((section("sfrs"), address(0xBF8EA808)));
typedef struct {
  uint32_t PIXEL023:4;
  uint32_t PIXEL022:4;
  uint32_t PIXEL021:4;
  uint32_t PIXEL020:4;
  uint32_t PIXEL019:4;
  uint32_t PIXEL018:4;
  uint32_t PIXEL017:4;
  uint32_t PIXEL016:4;
} __GLCDCURDATA2bits_t;
extern volatile __GLCDCURDATA2bits_t GLCDCURDATA2bits __asm__ ("GLCDCURDATA2") __attribute__((section("sfrs"), address(0xBF8EA808)));
#define GLCDCURDATA3 GLCDCURDATA3
extern volatile uint32_t   GLCDCURDATA3 __attribute__((section("sfrs"), address(0xBF8EA80C)));
typedef struct {
  uint32_t PIXEL031:4;
  uint32_t PIXEL030:4;
  uint32_t PIXEL029:4;
  uint32_t PIXEL028:4;
  uint32_t PIXEL027:4;
  uint32_t PIXEL026:4;
  uint32_t PIXEL025:4;
  uint32_t PIXEL024:4;
} __GLCDCURDATA3bits_t;
extern volatile __GLCDCURDATA3bits_t GLCDCURDATA3bits __asm__ ("GLCDCURDATA3") __attribute__((section("sfrs"), address(0xBF8EA80C)));
#define GLCDCURDATA4 GLCDCURDATA4
extern volatile uint32_t   GLCDCURDATA4 __attribute__((section("sfrs"), address(0xBF8EA810)));
typedef struct {
  uint32_t PIXEL17:4;
  uint32_t PIXEL16:4;
  uint32_t PIXEL15:4;
  uint32_t PIXEL14:4;
  uint32_t PIXEL13:4;
  uint32_t PIXEL12:4;
  uint32_t PIXEL11:4;
  uint32_t PIXEL10:4;
} __GLCDCURDATA4bits_t;
