Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dag169.h
#define _GLCDCURDATA127_PIXEL3124_POSITION       0x0000001C
#define _GLCDCURDATA127_PIXEL3124_MASK           0xF0000000
#define _GLCDCURDATA127_PIXEL3124_LENGTH         0x00000004

#define _GLCDCURLUT0_BLUE_POSITION               0x00000000
#define _GLCDCURLUT0_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT0_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT0_GREEN_POSITION              0x00000008
#define _GLCDCURLUT0_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT0_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT0_RED_POSITION                0x00000010
#define _GLCDCURLUT0_RED_MASK                    0x00FF0000
#define _GLCDCURLUT0_RED_LENGTH                  0x00000008

#define _GLCDCURLUT1_BLUE_POSITION               0x00000000
#define _GLCDCURLUT1_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT1_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT1_GREEN_POSITION              0x00000008
#define _GLCDCURLUT1_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT1_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT1_RED_POSITION                0x00000010
#define _GLCDCURLUT1_RED_MASK                    0x00FF0000
#define _GLCDCURLUT1_RED_LENGTH                  0x00000008

#define _GLCDCURLUT2_BLUE_POSITION               0x00000000
#define _GLCDCURLUT2_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT2_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT2_GREEN_POSITION              0x00000008
#define _GLCDCURLUT2_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT2_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT2_RED_POSITION                0x00000010
#define _GLCDCURLUT2_RED_MASK                    0x00FF0000
#define _GLCDCURLUT2_RED_LENGTH                  0x00000008

#define _GLCDCURLUT3_BLUE_POSITION               0x00000000
#define _GLCDCURLUT3_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT3_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT3_GREEN_POSITION              0x00000008
#define _GLCDCURLUT3_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT3_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT3_RED_POSITION                0x00000010
#define _GLCDCURLUT3_RED_MASK                    0x00FF0000
#define _GLCDCURLUT3_RED_LENGTH                  0x00000008

#define _GLCDCURLUT4_BLUE_POSITION               0x00000000
#define _GLCDCURLUT4_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT4_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT4_GREEN_POSITION              0x00000008
#define _GLCDCURLUT4_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT4_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT4_RED_POSITION                0x00000010
#define _GLCDCURLUT4_RED_MASK                    0x00FF0000
#define _GLCDCURLUT4_RED_LENGTH                  0x00000008

#define _GLCDCURLUT5_BLUE_POSITION               0x00000000
#define _GLCDCURLUT5_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT5_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT5_GREEN_POSITION              0x00000008
#define _GLCDCURLUT5_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT5_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT5_RED_POSITION                0x00000010
#define _GLCDCURLUT5_RED_MASK                    0x00FF0000
#define _GLCDCURLUT5_RED_LENGTH                  0x00000008

#define _GLCDCURLUT6_BLUE_POSITION               0x00000000
#define _GLCDCURLUT6_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT6_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT6_GREEN_POSITION              0x00000008
#define _GLCDCURLUT6_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT6_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT6_RED_POSITION                0x00000010
#define _GLCDCURLUT6_RED_MASK                    0x00FF0000
#define _GLCDCURLUT6_RED_LENGTH                  0x00000008

#define _GLCDCURLUT7_BLUE_POSITION               0x00000000
#define _GLCDCURLUT7_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT7_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT7_GREEN_POSITION              0x00000008
#define _GLCDCURLUT7_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT7_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT7_RED_POSITION                0x00000010
#define _GLCDCURLUT7_RED_MASK                    0x00FF0000
#define _GLCDCURLUT7_RED_LENGTH                  0x00000008

#define _GLCDCURLUT8_BLUE_POSITION               0x00000000
#define _GLCDCURLUT8_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT8_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT8_GREEN_POSITION              0x00000008
#define _GLCDCURLUT8_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT8_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT8_RED_POSITION                0x00000010
#define _GLCDCURLUT8_RED_MASK                    0x00FF0000
#define _GLCDCURLUT8_RED_LENGTH                  0x00000008

#define _GLCDCURLUT9_BLUE_POSITION               0x00000000
#define _GLCDCURLUT9_BLUE_MASK                   0x000000FF
#define _GLCDCURLUT9_BLUE_LENGTH                 0x00000008

#define _GLCDCURLUT9_GREEN_POSITION              0x00000008
#define _GLCDCURLUT9_GREEN_MASK                  0x0000FF00
#define _GLCDCURLUT9_GREEN_LENGTH                0x00000008

#define _GLCDCURLUT9_RED_POSITION                0x00000010
#define _GLCDCURLUT9_RED_MASK                    0x00FF0000
#define _GLCDCURLUT9_RED_LENGTH                  0x00000008

#define _GLCDCURLUT10_BLUE_POSITION              0x00000000
#define _GLCDCURLUT10_BLUE_MASK                  0x000000FF
#define _GLCDCURLUT10_BLUE_LENGTH                0x00000008

#define _GLCDCURLUT10_GREEN_POSITION             0x00000008
#define _GLCDCURLUT10_GREEN_MASK                 0x0000FF00
#define _GLCDCURLUT10_GREEN_LENGTH               0x00000008

#define _GLCDCURLUT10_RED_POSITION               0x00000010
#define _GLCDCURLUT10_RED_MASK                   0x00FF0000
#define _GLCDCURLUT10_RED_LENGTH                 0x00000008

#define _GLCDCURLUT11_BLUE_POSITION              0x00000000
#define _GLCDCURLUT11_BLUE_MASK                  0x000000FF
#define _GLCDCURLUT11_BLUE_LENGTH                0x00000008

#define _GLCDCURLUT11_GREEN_POSITION             0x00000008
#define _GLCDCURLUT11_GREEN_MASK                 0x0000FF00
#define _GLCDCURLUT11_GREEN_LENGTH               0x00000008

#define _GLCDCURLUT11_RED_POSITION               0x00000010
#define _GLCDCURLUT11_RED_MASK                   0x00FF0000
#define _GLCDCURLUT11_RED_LENGTH                 0x00000008

